espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_iadc.h
/* Bit fields for IADC SCHED */
#define _IADC_SCHED_RESETVALUE                          0x00000000UL                        /**< Default value for IADC_SCHED                */
#define _IADC_SCHED_MASK                                0x000003FFUL                        /**< Mask for IADC_SCHED                         */
#define _IADC_SCHED_PRESCALE_SHIFT                      0                                   /**< Shift value for IADC_PRESCALE               */
#define _IADC_SCHED_PRESCALE_MASK                       0x3FFUL                             /**< Bit mask for IADC_PRESCALE                  */
#define _IADC_SCHED_PRESCALE_DEFAULT                    0x00000000UL                        /**< Mode DEFAULT for IADC_SCHED                 */
#define IADC_SCHED_PRESCALE_DEFAULT                     (_IADC_SCHED_PRESCALE_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_SCHED         */

/* Bit fields for IADC SINGLEFIFOCFG */
#define _IADC_SINGLEFIFOCFG_RESETVALUE                  0x00000030UL                                        /**< Default value for IADC_SINGLEFIFOCFG        */
#define _IADC_SINGLEFIFOCFG_MASK                        0x0000017FUL                                        /**< Mask for IADC_SINGLEFIFOCFG                 */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_SHIFT             0                                                   /**< Shift value for IADC_ALIGNMENT              */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_MASK              0x7UL                                               /**< Bit mask for IADC_ALIGNMENT                 */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_DEFAULT           0x00000000UL                                        /**< Mode DEFAULT for IADC_SINGLEFIFOCFG         */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT12           0x00000000UL                                        /**< Mode RIGHT12 for IADC_SINGLEFIFOCFG         */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT16           0x00000001UL                                        /**< Mode RIGHT16 for IADC_SINGLEFIFOCFG         */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT20           0x00000002UL                                        /**< Mode RIGHT20 for IADC_SINGLEFIFOCFG         */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT12            0x00000003UL                                        /**< Mode LEFT12 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT16            0x00000004UL                                        /**< Mode LEFT16 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT20            0x00000005UL                                        /**< Mode LEFT20 for IADC_SINGLEFIFOCFG          */
#define IADC_SINGLEFIFOCFG_ALIGNMENT_DEFAULT            (_IADC_SINGLEFIFOCFG_ALIGNMENT_DEFAULT << 0)        /**< Shifted mode DEFAULT for IADC_SINGLEFIFOCFG */
#define IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT12            (_IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT12 << 0)        /**< Shifted mode RIGHT12 for IADC_SINGLEFIFOCFG */
#define IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT16            (_IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT16 << 0)        /**< Shifted mode RIGHT16 for IADC_SINGLEFIFOCFG */
#define IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT20            (_IADC_SINGLEFIFOCFG_ALIGNMENT_RIGHT20 << 0)        /**< Shifted mode RIGHT20 for IADC_SINGLEFIFOCFG */
#define IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT12             (_IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT12 << 0)         /**< Shifted mode LEFT12 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT16             (_IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT16 << 0)         /**< Shifted mode LEFT16 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT20             (_IADC_SINGLEFIFOCFG_ALIGNMENT_LEFT20 << 0)         /**< Shifted mode LEFT20 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_SHOWID                       (0x1UL << 3)                                        /**< Show ID                                     */
#define _IADC_SINGLEFIFOCFG_SHOWID_SHIFT                3                                                   /**< Shift value for IADC_SHOWID                 */
#define _IADC_SINGLEFIFOCFG_SHOWID_MASK                 0x8UL                                               /**< Bit mask for IADC_SHOWID                    */
#define _IADC_SINGLEFIFOCFG_SHOWID_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for IADC_SINGLEFIFOCFG         */
#define IADC_SINGLEFIFOCFG_SHOWID_DEFAULT               (_IADC_SINGLEFIFOCFG_SHOWID_DEFAULT << 3)           /**< Shifted mode DEFAULT for IADC_SINGLEFIFOCFG */
#define _IADC_SINGLEFIFOCFG_DVL_SHIFT                   4                                                   /**< Shift value for IADC_DVL                    */
#define _IADC_SINGLEFIFOCFG_DVL_MASK                    0x70UL                                              /**< Bit mask for IADC_DVL                       */
#define _IADC_SINGLEFIFOCFG_DVL_DEFAULT                 0x00000003UL                                        /**< Mode DEFAULT for IADC_SINGLEFIFOCFG         */
#define _IADC_SINGLEFIFOCFG_DVL_VALID1                  0x00000000UL                                        /**< Mode VALID1 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_DVL_VALID2                  0x00000001UL                                        /**< Mode VALID2 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_DVL_VALID3                  0x00000002UL                                        /**< Mode VALID3 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_DVL_VALID4                  0x00000003UL                                        /**< Mode VALID4 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_DVL_VALID5                  0x00000004UL                                        /**< Mode VALID5 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_DVL_VALID6                  0x00000005UL                                        /**< Mode VALID6 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_DVL_VALID7                  0x00000006UL                                        /**< Mode VALID7 for IADC_SINGLEFIFOCFG          */
#define _IADC_SINGLEFIFOCFG_DVL_VALID8                  0x00000007UL                                        /**< Mode VALID8 for IADC_SINGLEFIFOCFG          */
#define IADC_SINGLEFIFOCFG_DVL_DEFAULT                  (_IADC_SINGLEFIFOCFG_DVL_DEFAULT << 4)              /**< Shifted mode DEFAULT for IADC_SINGLEFIFOCFG */
#define IADC_SINGLEFIFOCFG_DVL_VALID1                   (_IADC_SINGLEFIFOCFG_DVL_VALID1 << 4)               /**< Shifted mode VALID1 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DVL_VALID2                   (_IADC_SINGLEFIFOCFG_DVL_VALID2 << 4)               /**< Shifted mode VALID2 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DVL_VALID3                   (_IADC_SINGLEFIFOCFG_DVL_VALID3 << 4)               /**< Shifted mode VALID3 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DVL_VALID4                   (_IADC_SINGLEFIFOCFG_DVL_VALID4 << 4)               /**< Shifted mode VALID4 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DVL_VALID5                   (_IADC_SINGLEFIFOCFG_DVL_VALID5 << 4)               /**< Shifted mode VALID5 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DVL_VALID6                   (_IADC_SINGLEFIFOCFG_DVL_VALID6 << 4)               /**< Shifted mode VALID6 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DVL_VALID7                   (_IADC_SINGLEFIFOCFG_DVL_VALID7 << 4)               /**< Shifted mode VALID7 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DVL_VALID8                   (_IADC_SINGLEFIFOCFG_DVL_VALID8 << 4)               /**< Shifted mode VALID8 for IADC_SINGLEFIFOCFG  */
#define IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE              (0x1UL << 8)                                        /**< Single FIFO DMA wakeup.                     */
#define _IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_SHIFT       8                                                   /**< Shift value for IADC_DMAWUFIFOSINGLE        */
#define _IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_MASK        0x100UL                                             /**< Bit mask for IADC_DMAWUFIFOSINGLE           */
#define _IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_DEFAULT     0x00000000UL                                        /**< Mode DEFAULT for IADC_SINGLEFIFOCFG         */
#define _IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_DISABLED    0x00000000UL                                        /**< Mode DISABLED for IADC_SINGLEFIFOCFG        */
#define _IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_ENABLED     0x00000001UL                                        /**< Mode ENABLED for IADC_SINGLEFIFOCFG         */
#define IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_DEFAULT      (_IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_DEFAULT << 8)  /**< Shifted mode DEFAULT for IADC_SINGLEFIFOCFG */
#define IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_DISABLED     (_IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_DISABLED << 8) /**< Shifted mode DISABLED for IADC_SINGLEFIFOCFG*/
#define IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_ENABLED      (_IADC_SINGLEFIFOCFG_DMAWUFIFOSINGLE_ENABLED << 8)  /**< Shifted mode ENABLED for IADC_SINGLEFIFOCFG */

/* Bit fields for IADC SINGLEFIFODATA */
#define _IADC_SINGLEFIFODATA_RESETVALUE                 0x00000000UL                             /**< Default value for IADC_SINGLEFIFODATA       */
#define _IADC_SINGLEFIFODATA_MASK                       0xFFFFFFFFUL                             /**< Mask for IADC_SINGLEFIFODATA                */
#define _IADC_SINGLEFIFODATA_DATA_SHIFT                 0                                        /**< Shift value for IADC_DATA                   */
#define _IADC_SINGLEFIFODATA_DATA_MASK                  0xFFFFFFFFUL                             /**< Bit mask for IADC_DATA                      */
#define _IADC_SINGLEFIFODATA_DATA_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for IADC_SINGLEFIFODATA        */
#define IADC_SINGLEFIFODATA_DATA_DEFAULT                (_IADC_SINGLEFIFODATA_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_SINGLEFIFODATA*/

/* Bit fields for IADC SINGLEFIFOSTAT */
#define _IADC_SINGLEFIFOSTAT_RESETVALUE                 0x00000000UL                                    /**< Default value for IADC_SINGLEFIFOSTAT       */
#define _IADC_SINGLEFIFOSTAT_MASK                       0x0000000FUL                                    /**< Mask for IADC_SINGLEFIFOSTAT                */
#define _IADC_SINGLEFIFOSTAT_FIFOREADCNT_SHIFT          0                                               /**< Shift value for IADC_FIFOREADCNT            */
#define _IADC_SINGLEFIFOSTAT_FIFOREADCNT_MASK           0xFUL                                           /**< Bit mask for IADC_FIFOREADCNT               */
#define _IADC_SINGLEFIFOSTAT_FIFOREADCNT_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for IADC_SINGLEFIFOSTAT        */
#define IADC_SINGLEFIFOSTAT_FIFOREADCNT_DEFAULT         (_IADC_SINGLEFIFOSTAT_FIFOREADCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_SINGLEFIFOSTAT*/

/* Bit fields for IADC SINGLEDATA */
#define _IADC_SINGLEDATA_RESETVALUE                     0x00000000UL                         /**< Default value for IADC_SINGLEDATA           */
#define _IADC_SINGLEDATA_MASK                           0xFFFFFFFFUL                         /**< Mask for IADC_SINGLEDATA                    */
#define _IADC_SINGLEDATA_DATA_SHIFT                     0                                    /**< Shift value for IADC_DATA                   */
#define _IADC_SINGLEDATA_DATA_MASK                      0xFFFFFFFFUL                         /**< Bit mask for IADC_DATA                      */
#define _IADC_SINGLEDATA_DATA_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for IADC_SINGLEDATA            */
#define IADC_SINGLEDATA_DATA_DEFAULT                    (_IADC_SINGLEDATA_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_SINGLEDATA    */

/* Bit fields for IADC SCANFIFOCFG */
#define _IADC_SCANFIFOCFG_RESETVALUE                    0x00000030UL                                    /**< Default value for IADC_SCANFIFOCFG          */
#define _IADC_SCANFIFOCFG_MASK                          0x0000017FUL                                    /**< Mask for IADC_SCANFIFOCFG                   */
#define _IADC_SCANFIFOCFG_ALIGNMENT_SHIFT               0                                               /**< Shift value for IADC_ALIGNMENT              */
#define _IADC_SCANFIFOCFG_ALIGNMENT_MASK                0x7UL                                           /**< Bit mask for IADC_ALIGNMENT                 */
#define _IADC_SCANFIFOCFG_ALIGNMENT_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for IADC_SCANFIFOCFG           */
#define _IADC_SCANFIFOCFG_ALIGNMENT_RIGHT12             0x00000000UL                                    /**< Mode RIGHT12 for IADC_SCANFIFOCFG           */
#define _IADC_SCANFIFOCFG_ALIGNMENT_RIGHT16             0x00000001UL                                    /**< Mode RIGHT16 for IADC_SCANFIFOCFG           */
#define _IADC_SCANFIFOCFG_ALIGNMENT_RIGHT20             0x00000002UL                                    /**< Mode RIGHT20 for IADC_SCANFIFOCFG           */
#define _IADC_SCANFIFOCFG_ALIGNMENT_LEFT12              0x00000003UL                                    /**< Mode LEFT12 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_ALIGNMENT_LEFT16              0x00000004UL                                    /**< Mode LEFT16 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_ALIGNMENT_LEFT20              0x00000005UL                                    /**< Mode LEFT20 for IADC_SCANFIFOCFG            */
#define IADC_SCANFIFOCFG_ALIGNMENT_DEFAULT              (_IADC_SCANFIFOCFG_ALIGNMENT_DEFAULT << 0)      /**< Shifted mode DEFAULT for IADC_SCANFIFOCFG   */
#define IADC_SCANFIFOCFG_ALIGNMENT_RIGHT12              (_IADC_SCANFIFOCFG_ALIGNMENT_RIGHT12 << 0)      /**< Shifted mode RIGHT12 for IADC_SCANFIFOCFG   */
#define IADC_SCANFIFOCFG_ALIGNMENT_RIGHT16              (_IADC_SCANFIFOCFG_ALIGNMENT_RIGHT16 << 0)      /**< Shifted mode RIGHT16 for IADC_SCANFIFOCFG   */
#define IADC_SCANFIFOCFG_ALIGNMENT_RIGHT20              (_IADC_SCANFIFOCFG_ALIGNMENT_RIGHT20 << 0)      /**< Shifted mode RIGHT20 for IADC_SCANFIFOCFG   */
#define IADC_SCANFIFOCFG_ALIGNMENT_LEFT12               (_IADC_SCANFIFOCFG_ALIGNMENT_LEFT12 << 0)       /**< Shifted mode LEFT12 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_ALIGNMENT_LEFT16               (_IADC_SCANFIFOCFG_ALIGNMENT_LEFT16 << 0)       /**< Shifted mode LEFT16 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_ALIGNMENT_LEFT20               (_IADC_SCANFIFOCFG_ALIGNMENT_LEFT20 << 0)       /**< Shifted mode LEFT20 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_SHOWID                         (0x1UL << 3)                                    /**< Show ID                                     */
#define _IADC_SCANFIFOCFG_SHOWID_SHIFT                  3                                               /**< Shift value for IADC_SHOWID                 */
#define _IADC_SCANFIFOCFG_SHOWID_MASK                   0x8UL                                           /**< Bit mask for IADC_SHOWID                    */
#define _IADC_SCANFIFOCFG_SHOWID_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for IADC_SCANFIFOCFG           */
#define IADC_SCANFIFOCFG_SHOWID_DEFAULT                 (_IADC_SCANFIFOCFG_SHOWID_DEFAULT << 3)         /**< Shifted mode DEFAULT for IADC_SCANFIFOCFG   */
#define _IADC_SCANFIFOCFG_DVL_SHIFT                     4                                               /**< Shift value for IADC_DVL                    */
#define _IADC_SCANFIFOCFG_DVL_MASK                      0x70UL                                          /**< Bit mask for IADC_DVL                       */
#define _IADC_SCANFIFOCFG_DVL_DEFAULT                   0x00000003UL                                    /**< Mode DEFAULT for IADC_SCANFIFOCFG           */
#define _IADC_SCANFIFOCFG_DVL_VALID1                    0x00000000UL                                    /**< Mode VALID1 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_DVL_VALID2                    0x00000001UL                                    /**< Mode VALID2 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_DVL_VALID3                    0x00000002UL                                    /**< Mode VALID3 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_DVL_VALID4                    0x00000003UL                                    /**< Mode VALID4 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_DVL_VALID5                    0x00000004UL                                    /**< Mode VALID5 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_DVL_VALID6                    0x00000005UL                                    /**< Mode VALID6 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_DVL_VALID7                    0x00000006UL                                    /**< Mode VALID7 for IADC_SCANFIFOCFG            */
#define _IADC_SCANFIFOCFG_DVL_VALID8                    0x00000007UL                                    /**< Mode VALID8 for IADC_SCANFIFOCFG            */
#define IADC_SCANFIFOCFG_DVL_DEFAULT                    (_IADC_SCANFIFOCFG_DVL_DEFAULT << 4)            /**< Shifted mode DEFAULT for IADC_SCANFIFOCFG   */
#define IADC_SCANFIFOCFG_DVL_VALID1                     (_IADC_SCANFIFOCFG_DVL_VALID1 << 4)             /**< Shifted mode VALID1 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DVL_VALID2                     (_IADC_SCANFIFOCFG_DVL_VALID2 << 4)             /**< Shifted mode VALID2 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DVL_VALID3                     (_IADC_SCANFIFOCFG_DVL_VALID3 << 4)             /**< Shifted mode VALID3 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DVL_VALID4                     (_IADC_SCANFIFOCFG_DVL_VALID4 << 4)             /**< Shifted mode VALID4 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DVL_VALID5                     (_IADC_SCANFIFOCFG_DVL_VALID5 << 4)             /**< Shifted mode VALID5 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DVL_VALID6                     (_IADC_SCANFIFOCFG_DVL_VALID6 << 4)             /**< Shifted mode VALID6 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DVL_VALID7                     (_IADC_SCANFIFOCFG_DVL_VALID7 << 4)             /**< Shifted mode VALID7 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DVL_VALID8                     (_IADC_SCANFIFOCFG_DVL_VALID8 << 4)             /**< Shifted mode VALID8 for IADC_SCANFIFOCFG    */
#define IADC_SCANFIFOCFG_DMAWUFIFOSCAN                  (0x1UL << 8)                                    /**< Scan FIFO DMA Wakeup                        */
#define _IADC_SCANFIFOCFG_DMAWUFIFOSCAN_SHIFT           8                                               /**< Shift value for IADC_DMAWUFIFOSCAN          */
#define _IADC_SCANFIFOCFG_DMAWUFIFOSCAN_MASK            0x100UL                                         /**< Bit mask for IADC_DMAWUFIFOSCAN             */
#define _IADC_SCANFIFOCFG_DMAWUFIFOSCAN_DEFAULT         0x00000000UL                                    /**< Mode DEFAULT for IADC_SCANFIFOCFG           */
#define _IADC_SCANFIFOCFG_DMAWUFIFOSCAN_DISABLED        0x00000000UL                                    /**< Mode DISABLED for IADC_SCANFIFOCFG          */
#define _IADC_SCANFIFOCFG_DMAWUFIFOSCAN_ENABLED         0x00000001UL                                    /**< Mode ENABLED for IADC_SCANFIFOCFG           */
#define IADC_SCANFIFOCFG_DMAWUFIFOSCAN_DEFAULT          (_IADC_SCANFIFOCFG_DMAWUFIFOSCAN_DEFAULT << 8)  /**< Shifted mode DEFAULT for IADC_SCANFIFOCFG   */
#define IADC_SCANFIFOCFG_DMAWUFIFOSCAN_DISABLED         (_IADC_SCANFIFOCFG_DMAWUFIFOSCAN_DISABLED << 8) /**< Shifted mode DISABLED for IADC_SCANFIFOCFG  */
#define IADC_SCANFIFOCFG_DMAWUFIFOSCAN_ENABLED          (_IADC_SCANFIFOCFG_DMAWUFIFOSCAN_ENABLED << 8)  /**< Shifted mode ENABLED for IADC_SCANFIFOCFG   */

/* Bit fields for IADC SCANFIFODATA */
#define _IADC_SCANFIFODATA_RESETVALUE                   0x00000000UL                           /**< Default value for IADC_SCANFIFODATA         */
#define _IADC_SCANFIFODATA_MASK                         0xFFFFFFFFUL                           /**< Mask for IADC_SCANFIFODATA                  */
#define _IADC_SCANFIFODATA_DATA_SHIFT                   0                                      /**< Shift value for IADC_DATA                   */
#define _IADC_SCANFIFODATA_DATA_MASK                    0xFFFFFFFFUL                           /**< Bit mask for IADC_DATA                      */
#define _IADC_SCANFIFODATA_DATA_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for IADC_SCANFIFODATA          */
#define IADC_SCANFIFODATA_DATA_DEFAULT                  (_IADC_SCANFIFODATA_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_SCANFIFODATA  */

